### 📋 Terraform Plan: `aws/dfbx/eu-south-2/labs/hands-on-datadog/lambda/lambda-instrumented`

✅ **Plan Status:** Success
⚠️ **Format Check:** Failed (non-blocking)

<details><summary>📄 Plan Output</summary>

```terraform
[0;90m01:42:41.685[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.external.archive_prepare[0]: Reading...
[0;90m01:42:41.766[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.external.archive_prepare[0]: Read complete after 0s [id=-]
[0;90m01:42:42.130[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Reading...
[0;90m01:42:42.130[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Reading...
[0;90m01:42:42.130[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Reading...
[0;90m01:42:42.132[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Reading...
[0;90m01:42:42.132[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Reading...
[0;90m01:42:42.132[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_partition.current: Read complete after 0s [id=aws]
[0;90m01:42:42.132[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_region.current: Read complete after 0s [id=eu-south-2]
[0;90m01:42:42.134[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1425019725]
[0;90m01:42:42.135[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
[0;90m01:42:42.236[0m [0;37mSTDOUT[0m [0;36mterraform: [0mdata.aws_caller_identity.current: Read complete after 0s [id=743199288519]
[0;90m01:42:42.388[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform used the selected providers to generate the following execution
[0;90m01:42:42.388[0m [0;37mSTDOUT[0m [0;36mterraform: [0mplan. Resource actions are indicated with the following symbols:
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= read (data resources)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # data.aws_iam_policy_document.logs[0] will be read during apply
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # (config refers to values not yet known)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m <= data "aws_iam_policy_document" "logs" {
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id            = (known after apply)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + json          = (known after apply)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + minified_json = (known after apply)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + statement {
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + actions   = [
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogGroup",
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:CreateLogStream",
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "logs:PutLogEvents",
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + effect    = "Allow"
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + resources = (known after apply)
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_cloudwatch_log_group.lambda[0] will be created
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_group" "lambda" {
[0;90m01:42:42.389[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                         = (known after apply)
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + deletion_protection_enabled = (known after apply)
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                          = (known after apply)
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_class             = (known after apply)
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                        = "/aws/lambda/hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix                 = (known after apply)
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                      = "eu-south-2"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + retention_in_days           = 0
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy                = false
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                        = {
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.390[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                    = {
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role.lambda[0] will be created
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role" "lambda" {
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                   = (known after apply)
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + assume_role_policy    = jsonencode(
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action    = "sts:AssumeRole"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect    = "Allow"
[0;90m01:42:42.391[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Principal = {
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                          + Service = "lambda.amazonaws.com"
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                        }
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + create_date           = (known after apply)
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + force_detach_policies = true
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                    = (known after apply)
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + managed_policy_arns   = (known after apply)
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + max_session_duration  = 3600
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                  = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix           = (known after apply)
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + path                  = "/"
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                  = {
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.392[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all              = {
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.393[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + unique_id             = (known after apply)
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + inline_policy (known after apply)
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.additional_inline[0] will be created
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "additional_inline" {
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-inline"
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = jsonencode(
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            {
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Statement = [
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = "kms:Decrypt"
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "*"
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid      = "kmsdecrypt"
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + {
[0;90m01:42:42.394[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Action   = "ssm:GetParameter"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Effect   = "Allow"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Resource = "arn:aws:ssm:eu-south-2:743199288519:parameter/labs/datadog/DD_API_KEY"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                      + Sid      = "ssmread"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                    },
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + Version   = "2012-10-17"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        )
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_iam_role_policy.logs[0] will be created
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_iam_role_policy" "logs" {
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id          = (known after apply)
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name        = "hands-on-datadog-instrumented-eu-south-2-logs"
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix = (known after apply)
[0;90m01:42:42.395[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + policy      = (known after apply)
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role        = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_lambda_function.this[0] will be created
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_lambda_function" "this" {
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + architectures                  = (known after apply)
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                            = (known after apply)
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + code_sha256                    = (known after apply)
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description                    = "Lambda de laboratorio instrumentada con DataDog Layer"
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + filename                       = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip"
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + function_name                  = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.396[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + handler                        = "datadog_lambda.handler.handler"
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                             = (known after apply)
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + invoke_arn                     = (known after apply)
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + last_modified                  = (known after apply)
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + layers                         = [
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "arn:aws:lambda:eu-south-2:464622532012:layer:Datadog-Python312:97",
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "arn:aws:lambda:eu-south-2:464622532012:layer:Datadog-Extension:59",
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + memory_size                    = 128
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + package_type                   = "Zip"
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + publish                        = false
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + qualified_arn                  = (known after apply)
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + qualified_invoke_arn           = (known after apply)
[0;90m01:42:42.397[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + region                         = "eu-south-2"
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + reserved_concurrent_executions = -1
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + response_streaming_invoke_arn  = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + role                           = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + runtime                        = "python3.12"
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + signing_job_arn                = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + signing_profile_version_arn    = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy                   = false
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_code_hash               = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + source_code_size               = (known after apply)
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                           = {
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.398[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                       = {
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "created-by"  = "github-actions"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "creator"     = "terragrunt"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "dd-traced"   = "true"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "environment" = "labs"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "is-lab"      = "true"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "lab-name"    = "hands-on-datadog"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "owner"       = "dfbx"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "repository"  = "https://github.com/darthfabax-org/iac"
[0;90m01:42:42.399[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "state"       = "true"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ttl"         = "7d"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + timeout                        = 3
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version                        = (known after apply)
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + environment {
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + variables = {
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_API_KEY_SECRET_ARN"     = "arn:aws:ssm:eu-south-2:743199288519:parameter/labs/datadog/DD_API_KEY"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_CAPTURE_LAMBDA_PAYLOAD" = "false"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_ENV"                    = "labs"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_LAMBDA_HANDLER"         = "app.handler"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_SERVICE"                = "dd-lab-lambda"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_SITE"                   = "datadoghq.eu"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_TRACE_ENABLED"          = "true"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "DD_VERSION"                = "1.0.0"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            }
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ephemeral_storage {
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + size = 512
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + logging_config {
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + log_format = "Text"
[0;90m01:42:42.400[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + log_group  = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tracing_config (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_config {
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + ipv6_allowed_for_dual_stack = false
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + security_group_ids          = [
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "sg-0b054871c2af5cf6f",
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + subnet_ids                  = [
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "subnet-09f4bffc64da623f7",
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + "subnet-0ec3e8c57a1cf0762",
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            ]
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + vpc_id                      = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # local_file.archive_plan[0] will be created
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "local_file" "archive_plan" {
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content              = (sensitive value)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_base64sha256 = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_base64sha512 = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_md5          = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_sha1         = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_sha256       = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + content_sha512       = (known after apply)
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + directory_permission = "0755"
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + file_permission      = "0644"
[0;90m01:42:42.401[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + filename             = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.plan.json"
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                   = (known after apply)
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # null_resource.archive[0] will be created
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "null_resource" "archive" {
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id       = (known after apply)
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + triggers = {
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "filename"  = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip"
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "timestamp" = "1772588561755868000"
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # terraform_data.package_filename_for_hash[0] will be created
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "terraform_data" "package_filename_for_hash" {
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id               = (known after apply)
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + input            = {
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + filename = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip"
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + output           = (known after apply)
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + triggers_replace = [
[0;90m01:42:42.402[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip",
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 8 to add, 0 to change, 0 to destroy.
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_cloudwatch_log_group_arn                     = (known after apply)
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_cloudwatch_log_group_name                    = "/aws/lambda/hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_event_source_mapping_arn                     = {}
[0;90m01:42:42.403[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_event_source_mapping_function_arn            = {}
[0;90m01:42:42.404[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_event_source_mapping_state                   = {}
[0;90m01:42:42.404[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_event_source_mapping_state_transition_reason = {}
[0;90m01:42:42.405[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_event_source_mapping_uuid                    = {}
[0;90m01:42:42.405[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_arn                                 = (known after apply)
[0;90m01:42:42.406[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_arn_static                          = "arn:aws:lambda:eu-south-2:743199288519:function:hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.406[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_code_sha256                         = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_invoke_arn                          = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_last_modified                       = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_name                                = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_qualified_arn                       = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_qualified_invoke_arn                = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_signing_job_arn                     = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_signing_profile_version_arn         = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_source_code_hash                    = (known after apply)
[0;90m01:42:42.407[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_source_code_size                    = (known after apply)
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_url                                 = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_url_id                              = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_function_version                             = (known after apply)
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_arn                                    = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_code_sha256                            = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_created_date                           = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_layer_arn                              = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_source_code_hash                       = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_source_code_size                       = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_layer_version                                = ""
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_arn                                     = (known after apply)
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_name                                    = "hands-on-datadog-instrumented-eu-south-2"
[0;90m01:42:42.408[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lambda_role_unique_id                               = (known after apply)
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + local_filename                                      = "builds/563d409278444530e1eef167a56e354a977b1619e320ba2cb12bcbc70ab26e23.zip"
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + s3_object                                           = {
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + bucket     = null
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key        = null
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + version_id = null
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0mNote: You didn't use the -out option to save this plan, so Terraform can't
[0;90m01:42:42.409[0m [0;37mSTDOUT[0m [0;36mterraform: [0mguarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

---
*Workflow: [Terragrunt Plan IaC](https://github.com/darthfabax-org/iac/actions/runs/22651205778)*